import csv
import re

sentence_endings = r'[.!]'

text = """ 
        Όλα αυτά τα αντικείμενα μετατοπίζονται την ώρα που το παιδί επιστρέφει από το σκολειό.
        Τότε το σκέπασμα του μπαούλου ανοίγει και η μάνα, έχοντας το παιδί πάνω στα γόνατα, αρχινά
        να του λέει ιστορίες διάφορες, που αποτελούν έναν διαφορετικό τρόπο αγωγής, από την σχολική παιδεία.
        Καταρχήν ένα φιλάκι για το καλωσόρισμα. Οι ερωτήσεις για το πώς τα πήγε με το δάσκαλο. Μετά η πρώτη αφορμή χαδιών,
        μ' ένα παιχνιδάκι ερωταποκρίσεων: — «Πήγες στο κυνήγι;» — «Σκότωσες λαγό;» — «Τι τον έκαμες;» — 
        «Πού τον έβανες;». Εν συνεχεία η προσπάθεια να ανοιχτεί το ερμάρι*, των δύο σφιχτά κλεισμένων παλαμών του παιδιού,
        ώστε να βρούνε μέσα την επαλήθευση των λεγομένων. Το λαγό καλομαγειρεμένο, στιφάδο. Σπάνει το πρώτο κλειδί: «τσακ».
        Τοιμάζει ο χαλκιάς ένα δεύτερο. Μ' αυτό ανοίγει η ντουλάπα, αλλά δε βρίσκουν μέσα τίποτα.
        Το παιχνίδι συνεχίζεται με σειρά αλλεπάλληλων ερωτήσεων περί του τι έγινε ο μεγαλύτερος λαγός.
        Απάντηση πρώτη: — «Τον έφαγε η γάτα». Μετά ότι την γάτα, που ήταν πάνω στα κεραμίδια, την πήρε το ποτάμι προκαλώντας βλάβες σ' όλο το σπίτι.
        Όσον αφορά την αγελάδα που ρούφηξε το ποτάμι, παρέχεται εν συνεχεία η πληροφορία ότι την έσφαξε ο χασάπης και ότι ο χασάπης πέθανε και βγάλανε το ξόδι* του,
        από της Καλαμαριάς την πόρτα. Λέγοντας τα στερνά αυτά λόγια, η μάνα γαργαλάει το μικρό παιδί στο λαιμάκο του, λέγοντας:
        «Πράσα μ' γένεια και μουστάκια» και το παιδί αναταράζεται ολόκληρο, καταλήγοντας από τα ζηλότυπα γελάκια στα δάκρυα.
    """

def split_sentences(text):
    # Split the text into sentences using the punctuation marks defined
    sentences = re.split(sentence_endings, text)
    # Remove any extra spaces, empty sentences, and sentences with 4 or fewer words
    sentences = [
        sentence.strip() 
        for sentence in sentences 
        if sentence.strip() and len(sentence.split()) > 4
    ]
    return sentences

sent = split_sentences(text)
print(sent)